_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 982, 40)           360       
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 975, 40)           0         
_________________________________________________________________
activation_1 (Activation)    (None, 975, 40)           0         
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 972, 40)           0         
_________________________________________________________________
activation_2 (Activation)    (None, 972, 40)           0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 38880)             0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 38880)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               19907072  
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 1539      
=================================================================
Total params: 19,908,971
Trainable params: 19,908,971
Non-trainable params: 0
_________________________________________________________________
Accuracy : 0.5315682281059063
